pkg/wsman/wsmantesting/responses/cim/battery/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Battery"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>173</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-000000000351</b:MessageID>
        <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Battery</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:CIM_Battery>
            <g:BatteryStatus>2</g:BatteryStatus>
            <g:ChargingStatus>0</g:ChargingStatus>
            <g:Chemistry>2</g:Chemistry>
            <g:CreationClassName>CIM_Battery</g:CreationClassName>
            <g:DesignCapacity>5601</g:DesignCapacity>
            <g:DesignVoltage>11550</g:DesignVoltage>
            <g:DeviceID>CC03056XL</g:DeviceID>
            <g:ElementName></g:ElementName>
            <g:EnabledState>2</g:EnabledState>
            <g:EstimatedChargeRemaining>0</g:EstimatedChargeRemaining>
            <g:FullChargeCapacity>0</g:FullChargeCapacity>
            <g:HealthState>0</g:HealthState>
            <g:RequestedState>2</g:RequestedState>
            <g:SystemCreationClassName>CIM_ComputerSystem</g:SystemCreationClassName>
            <g:SystemName>ManagedSystem</g:SystemName>
        </g:CIM_Battery>
    </a:Body>
</a:Envelope>
